cases/subsonic/Lambert/J10_kernelStudy/b_0_PCM/setup/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
// Lambert (ILASS 2019) — caso J=10, We=1500
// rho_g = 506625/(287*300) = 5.884 kg/m3
// We = rho_g * u_g^2 * D_jet / sigma = 1500
// sigma_JetA1 = 0.0225 N/m a 300 K
// u_g = sqrt(1500*0.0225/(5.884*0.000457)) = 112 m/s
//

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (112 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (112 0 0);
    }

    outletRight
    {
        type            pressureInletOutletVelocity;
        inletValue      uniform (0 0 0);
        value           uniform (112 0 0);
    }

    outletTop
    {
        type            pressureInletOutletVelocity;
        inletValue      uniform (0 0 0);
        value           uniform (112 0 0);
    }

    wall
    {
        type            noSlip;
    }

    front
    {
        type            symmetry;
    }

    back
    {
        type            symmetry;
    }
}

// ************************************************************************* //
