cases/subsonic/Lambert/J10_kernelStudy/b_0_PCM/setup/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
// omega = Cmu^(-0.25) * k^0.5 / L_t
// L_t = 0.07 * D_h = 0.07 * 0.04318 = 0.003023 m
// omega = 1.8257 * sqrt(47.0) / 0.003023 = 4140 s^-1
//

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 4140;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 4140;
    }

    outletRight
    {
        type            inletOutlet;
        inletValue      uniform 4140;
        value           uniform 4140;
    }

    wallTop
    {
        type            omegaWallFunction;
        value           uniform 4140;
    }

    wallBottom
    {
        type            omegaWallFunction;
        value           uniform 4140;
    }

    front
    {
        type            symmetry;
    }

    back
    {
        type            symmetry;
    }
}

// ************************************************************************* //
